{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.6.0", "userDefinedMetadata": {"signature": {"inputs": {"X:0": {"name": "X:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}, "outputs": {"accuracy/prediction:0": {"name": "accuracy/prediction:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}}}, "modelTopology": {"node": [{"name": "droput_layer/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "X", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}}, {"name": "Layer1/W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}}}, {"name": "Layer1/B", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "droput_layer/GreaterEqual/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "Layer2/W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}}}, {"name": "Layer2/B", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "out/W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "out/B", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "accuracy/prediction/dimension", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Layer1/MatMul", "op": "MatMul", "input": ["X", "Layer1/W"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "Layer1/add", "op": "AddV2", "input": ["Layer1/MatMul", "Layer1/B"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Layer1/Relu", "op": "Relu", "input": ["Layer1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "droput_layer/Mul", "op": "Mul", "input": ["droput_layer/Const", "Layer1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "droput_layer/Shape", "op": "Shape", "input": ["Layer1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "droput_layer/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["droput_layer/Shape"], "attr": {"dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}, "seed": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "droput_layer/GreaterEqual", "op": "GreaterEqual", "input": ["droput_layer/random_uniform/RandomUniform", "droput_layer/GreaterEqual/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "droput_layer/Cast", "op": "Cast", "input": ["droput_layer/GreaterEqual"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "droput_layer/Mul_1", "op": "Mul", "input": ["droput_layer/Mul", "droput_layer/Cast"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Layer2/MatMul", "op": "MatMul", "input": ["droput_layer/Mul_1", "Layer2/W"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "Layer2/add", "op": "AddV2", "input": ["Layer2/MatMul", "Layer2/B"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Layer2/Relu", "op": "Relu", "input": ["Layer2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "out/MatMul", "op": "MatMul", "input": ["Layer2/Relu", "out/W"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "out/add", "op": "AddV2", "input": ["out/MatMul", "out/B"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "out/Softmax", "op": "Softmax", "input": ["out/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy/prediction", "op": "ArgMax", "input": ["out/Softmax", "accuracy/prediction/dimension"], "attr": {"output_type": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "droput_layer/Const", "shape": [], "dtype": "float32"}, {"name": "Layer1/W", "shape": [784, 512], "dtype": "float32"}, {"name": "Layer1/B", "shape": [512], "dtype": "float32"}, {"name": "droput_layer/GreaterEqual/y", "shape": [], "dtype": "float32"}, {"name": "Layer2/W", "shape": [512, 64], "dtype": "float32"}, {"name": "Layer2/B", "shape": [64], "dtype": "float32"}, {"name": "out/W", "shape": [64, 10], "dtype": "float32"}, {"name": "out/B", "shape": [10], "dtype": "float32"}, {"name": "accuracy/prediction/dimension", "shape": [], "dtype": "int32"}]}]}